app/controllers/anagramas_controller.rb

    def show
        @anagrama = Anagrama.find(params[:id])
---
SELECT  "anagramas".* FROM "anagramas" WHERE "anagramas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @anagrama = Anagrama.new(anagrama_params)
        @anagrama.resultado = @anagrama.verificar

        if @anagrama.save
---
INSERT INTO "anagramas" ("palavra1", "palavra2", "resultado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["palavra1", "da"], ["palavra2", "dddd"], ["resultado", "f"], ["created_at", "2017-11-14 14:09:52.993470"], ["updated_at", "2017-11-14 14:09:52.993470"]]

    def destroy
        @anagrama = Anagrama.find(params[:id])
        @anagrama.destroy
---
SELECT  "anagramas".* FROM "anagramas" WHERE "anagramas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "anagramas" WHERE "anagramas"."id" = ?  [["id", 1]]

        def index
        @anagramas = Anagrama.all
---
SELECT "anagramas".* FROM "anagramas"